import {COURSE} from '@/store/mutation-types';
import { getCourseList } from '@/api/course';

const state = {
    list: []
};

const mutations = {
    [COURSE.SET_COURSE_LIST]: (state, list) => {
        state.list = list || [];
    }
};

const actions = {
    getCourses({ commit, state }) {
        return new Promise((resolve, reject) => {
            getCourseList().then(response => {
                const { errno, entities } = response;
                if (errno === 0 && entities) {
                    commit(COURSE.SET_COURSE_LIST, entities);
                }
                resolve(response);
            }).catch(error => {
                // const response = {
                //     "errno":0,
                //     "error":"success",
                //     "total":0,
                //     "entities":[
                //         {"id":"110f4c30-4c0d-11ec-8f19-fa163e34a620","courseTag": "course3","address": "上海市工人文化宫","courseName":"匠心筑梦","longitude":21.2000000,"latitude":11.3000000,"pageContent":"结合思想道德修养与法律基础课第五章明大德守公德严私德第二节职业道德，将职业道德的基本要求：爱岗敬业、诚实守信、办事公道、服务群众、奉献社会中的核心爱岗敬业，通过参观工匠馆，列举大国工匠李斌的事例，来探讨工匠精神是怎样诠释爱岗敬业是职业道德核心这一内容的。坐落于上海市工人文化宫一楼的“上海工匠馆”，讲述了海派工匠的发展历史，展现了百余年来海派工匠的智慧与精湛技艺，是弘扬工匠精神的新高地、引领青年成才的新灯塔。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_110f4c30-4c0d-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_110f4c30-4c0d-11ec-8f19-fa163e34a620.jpeg;http://10.119.2.216:8081/img_2_110f4c30-4c0d-11ec-8f19-fa163e34a620.jpg","teacher":"沈全"},
                //         {"id":"192bd0a6-4d05-11ec-8f19-fa163e34a620","courseTag": "course4","address": "上海市总工会","courseName":"在劳动模范风采中感悟人民群众的创造伟力","pageContent":"《时代领跑者——上海劳动模范风采主题展》展馆永久落户14号上海市总工会一楼，展览由上海市总工会精心策划，以故事、图片、实物等形式，展现了新中国成立以后由全国总工会和上海市总工会评选出的其中一百五十多位上海市优秀劳模代表的动人事迹。本课程依托上海劳动模范风采展，通过参观和问题引导，让学生感悟人民群众是历史的创造者，把握树立唯物主义史观，坚持马克思主义群众观点，贯彻党的群众路线。\n","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_192bd0a6-4d05-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_192bd0a6-4d05-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_192bd0a6-4d05-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_3_192bd0a6-4d05-11ec-8f19-fa163e34a620.jpg","teacher":"王成峰"},
                //         {"id":"27e22e3b-4dd2-11ec-8f19-fa163e34a620","courseTag": "course13","address": "上海商学院","courseName":"坚守育人初心，传承师道使命-从教故事，育人情怀","pageContent":"坚守育人初心传承师德使命是所教师终其一生恪守的信念。本视频中的三位教师分别荣获上海商学院2016年度2018年度，2019年度师德标兵。他们立足本岗，为人为师为学，与学生一道“穷理以致其知，反躬以践其实”，引导培养他们有仁爱之心，有独立人格，有独立思考及判断能力。从他们的育人小故事中可以感受到育人的大情怀。师道使命颇似水，利他利己利万物，循环往复中滋润着人生。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_27e22e3b-4dd2-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_27e22e3b-4dd2-11ec-8f19-fa163e34a620.png","teacher":"袁美琴、胡学庆、陈小愚"},
                //         {"id":"3a88c653-4d07-11ec-8f19-fa163e34a620","courseTag": "course5","address": "中共上海地下组织斗争史陈列馆","courseName":"隐蔽战线之无声较量","pageContent":"本课程是结合大学本科《思想道德修养与法律基础》中“第五章第二节中为实现社会主义和共产主义理想而奋斗”的相关内容，依托红色博馆中共上海地下组织斗争史陈列馆，开展的一次实地微课。在中国共产党百年华诞之年，通过了解中共上海地下党在抗日战争和解放战争时期的历史，增强大学生学史明理、学史增信、学史崇德、学史力行。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_3a88c653-4d07-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_3a88c653-4d07-11ec-8f19-fa163e34a620.png;http://10.119.2.216:8081/img_2_3a88c653-4d07-11ec-8f19-fa163e34a620.jpg","teacher":"施阳九"},
                //         {"id":"3ee9fa5e-4dcf-11ec-8f19-fa163e34a620","courseTag": "course11","address": "上海商学院","courseName":"初心与使命：上商往事之一","pageContent":"本课程展示了上海商学院创校时期的老照片、老校徽、老报纸，讲述当年创校往事。七十多年前艰苦创校时，上海商学院就已经打上了红色的烙印：这是一所为党育人、为国育才的学校。老报纸见证着创校前辈艰苦奋斗的历史，老校徽上“忠诚”“朴实”“廉洁”“勤能”八个大字，是上海商学院一脉相承的学校精神，也铭刻着我们的初心和使命。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_3ee9fa5e-4dcf-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_2_3ee9fa5e-4dcf-11ec-8f19-fa163e34a620.jpeg","teacher":"李强"},
                //         {"id":"441e5e50-4dcd-11ec-8f19-fa163e34a620","courseTag": "course8","address": "上海市银行博物馆","courseName":"中国现代金融的起源与发展—上海市银行博物馆","pageContent":"上海是中国近代银行的发祥地。160年的上海金融史，就是中国现代金融的起源、发展的缩影。东西方银行文化交相辉映，奠定了上海远东金融中心的地位。\\n风雨160载，中国金融业经历了无数沧海桑田，潮起潮落，以早期钱庄业的繁荣为发端，中国经历了外资金融机构的抢滩进驻，华资金融机构的兴起发展，远东金融中心的地位确立等几大历史转折点，而今成为全球最具潜力的新兴金融市场。\n","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_441e5e50-4dcd-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_441e5e50-4dcd-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_441e5e50-4dcd-11ec-8f19-fa163e34a620.jpg","teacher":"李志刚"},
                //         {"id":"44dabd32-4d08-11ec-8f19-fa163e34a620","courseTag": "course6","address": "中共“四大”纪念馆","courseName":"中共四大与早期合作社运动","pageContent":"1925年1月11日至22日，中共四大在上海召开，大会总结了建党以来的经验，第一次明确提出无产阶级在民主革命中的领导权和工农联盟问题。中共四大统一了全党思想，为大革命高潮的到来作了政治上、思想上和组织上的准备。为了纪念这次会议，上海虹口区异地重建的中共“四大”纪念馆。纪念馆位于上海市虹口区四川北路绿地公园内，建筑面积为3180平方米，展览面积约1500平方米，由序厅、主展厅、影视厅和副展厅等组成。\n\\n1925年1月11日至22日，中共四大在上海召开，大会总结了建党以来的经验，第一次明确提出无产阶级在民主革命中的领导权和工农联盟问题。中共四大统一了全党思想，为大革命高潮的到来作了政治上、思想上和组织上的准备。为了纪念这次会议，上海虹口区异地重建的中共“四大”纪念馆。纪念馆位于上海市虹口区四川北路绿地公园内，建筑面积为3180平方米，展览面积约1500平方米，由序厅、主展厅、影视厅和副展厅等组成。\n","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_44dabd32-4d08-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_44dabd32-4d08-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_44dabd32-4d08-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_3_44dabd32-4d08-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_4_44dabd32-4d08-11ec-8f19-fa163e34a620.jpg","teacher":"付清海"},
                //         {"id":"53ad8eab-4dce-11ec-8f19-fa163e34a620","courseTag": "course10","address": "国家税务总局12366上海（国际）纳税服务中心","courseName":"税收的作用与改革——以人民为中心视角","pageContent":"本课程从财政支出角度阐述了税收是财政收入的重要来源，并对税收的无偿性等三个特性进行讲解，强调税收的作用是为了满足公共需求，是取之于民而用之于民的。同时针对我国不同时期的经济形势，对我国税收政策的变化进行讲解，通过税收政策的变化体会减税降费的实施与落实。\\n本次拍摄地在国家税务总局12366上海（国际）纳税服务中心，是集纳税资讯沟通渠道、服务方式创新基地、税法宣传前沿阵地等多功能的国际化高端纳税服务平台。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_53ad8eab-4dce-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_53ad8eab-4dce-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_53ad8eab-4dce-11ec-8f19-fa163e34a620.jpg","teacher":"万嘉伟"},
                //         {"id":"59992d86-4dcc-11ec-8f19-fa163e34a620","courseTag": "course9","address": "陈云纪念馆博物馆","courseName":"统一财经，打赢经济战","pageContent":"陈云先后是以毛泽东同志为核心的党的第一代中央领导集体、以邓小平同志为核心的党的第二代中央领导集体的重要成员，是改革开放初期中央决策层中起关键作用的人物，是中国社会主义经济建设的开创者和奠基人之一。中华人民共和国建立之初，我国国内的经济形势非常严峻，党和政府面临多方面的压力和挑战。陈云作为一位伟大的革命家，充分展现了他在“两白一黑”战役和“银元之战”中的果敢和智慧，保卫了上海，打赢了这场经济战，从而巩固了新生的政权。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_59992d86-4dcc-11ec-8f19-fa163e34a620.mp4","imageUrls":"","teacher":"周敏晖"},
                //         {"id":"628fef67-4d09-11ec-8f19-fa163e34a620","courseTag": "course7","address": "上海市银行博物馆","courseName":"金融初心，人民本位","pageContent":"本视频主要作为《马克思主义基本原理》课程第三章第三节中“无产阶级政党的群众路线”一目的教学案例和课外实践，通过参观银行博物馆，从许多珍贵的文物、照片、文献中由点及面，多角度、全景式地了解中国百年民族金融的变迁图景，鲜活感悟中国经济的沧桑巨变。在这百年巨变中，各个政党所领导的金融事业有没有为人民利益服务成为一项重要的风向标，标识出革命胜利和建设发展的方向。中国共产党不论是在革命还是建设时期，在推动金融发展过程中始终秉持服务人民的基本宗旨，是中国共产党群众路线的一个具体体现。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_628fef67-4d09-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_628fef67-4d09-11ec-8f19-fa163e34a620.png;http://10.119.2.216:8081/img_2_628fef67-4d09-11ec-8f19-fa163e34a620.png","teacher":"张小红"},
                //         {"id":"6309bc6e-4dd0-11ec-8f19-fa163e34a620","courseTag": "course12","address": "上海科技金融博物馆","courseName":"中国金融的红色基因","pageContent":"从新民主主义革命初期，中国共产党开始红色金融实践；到井冈山革命根据地时期，培育了中国金融的红色基因；中华苏维埃共和国时期，成立了国家银行；长征至解放时期，晋冀鲁豫边区的金融发展迅速；改革开放后，我国的金融业进入了新的发展阶段。回顾历史我们发现，金融与社会变革相辅相成，社会变革需要金融力量的支撑，金融也在社会变革中不断演进。通过探索中国金融中的红色基因，我们更深刻地理解了金融是国家的核心竞争力这一重要论述。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_6309bc6e-4dd0-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_6309bc6e-4dd0-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_6309bc6e-4dd0-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_3_6309bc6e-4dd0-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_4_6309bc6e-4dd0-11ec-8f19-fa163e34a620.jpg","teacher":"王小平"},
                //         {"id":"a18dc8a7-45ed-11ec-8f19-fa163e34a620","courseTag": "course1","address": "中国证券博物馆","courseName":"从证券事业的兴衰看马克思主义的发展性","longitude":123.4535340,"latitude":211.3243240,"pageContent":"中国证券博物馆于2018年1月经中央编办批复成立，是我国证券行业唯一一家国家级博物馆。馆内藏品丰富，以改革开放以来证券期货业发展的当代藏品为主，见证了新中国证券市场的诞生、发育和成长。本片借助馆内藏品，透过证券业在中国沉沉浮浮的历史画卷，帮助大家一起来体会马克思主义理论的一个重要特征——马克思主义的发展性，以进一步坚定马克思主义的信仰。\n","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_a18dc8a7-45ed-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_a18dc8a7-45ed-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_a18dc8a7-45ed-11ec-8f19-fa163e34a620.jpg","teacher":"姚志鹏"},
                //         {"id":"ad744b14-45ed-11ec-8f19-fa163e34a620","courseTag": "course2","address": "中共二大会址","courseName":"党章诞生地话党章中的经济思想","longitude":231.4353400,"latitude":213.4354330,"pageContent":"目前，我国已成为世界第二大经济体，成为推动世界经济增长的主要动力源。党的经济纲领是党章核心内容的重要组成部分，体现了党的经济理念、理想与追求，中国共产党党章中的经济思想关系着中国现代化建设的成败。本课程就是在中国共产党第一个党章的诞生地——中共二大会址，跟大家一起分享从一大到十九大，历次党章中的主要的经济思想。进而，从党的非凡历程中，感悟到一代代共产党人的初心和使命。","isView":false,"videoUrl":"http://10.119.2.216:8081/video_1_ad744b14-45ed-11ec-8f19-fa163e34a620.mp4","imageUrls":"http://10.119.2.216:8081/img_1_ad744b14-45ed-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_2_ad744b14-45ed-11ec-8f19-fa163e34a620.jpg;http://10.119.2.216:8081/img_3_ad744b14-45ed-11ec-8f19-fa163e34a620.jpg","teacher":"李新亮"}]}
                // const { errno, entities } = response;
                // if (errno === 0 && entities) {
                //     commit(COURSE.SET_COURSE_LIST, entities);
                // }
                // resolve(response);
                reject(error);
            });
        });
    },
};

export default {
    namespaced: true,
    state,
    mutations,
    actions
};
